import streamlit as st
from menu import menu_with_redirect
from utils.func import hide_header_icons

st.set_page_config(page_title=f"บทสรุป", page_icon="📍")
st.header(f":blue[บทสรุป]", divider=True)
# st.subheader(sub)

menu_with_redirect()
hide_header_icons()

st.markdown("**สรุปข้อมูลสำคัญจากการวิเคราะห์:**")
desc_msg1 = '''
    1. **ยอดขายเฉลี่ย**: Shopee มียอดขายเฉลี่ยสูงกว่า Lazada อย่างมีนัยสำคัญ โดยเฉลี่ย Shopee ขายได้ 186,093.12 บาทต่อสินค้า ขณะที่ Lazada ขายได้เฉลี่ย 54,334.93 บาท
    2. **สินค้าที่ขายดีที่สุด**:
        - Shopee: ข้าวเหนียวพันธุ์ กข6 ขายได้ 155,436 ชิ้น
        - Lazada: ข้าวเหนียวเขี้ยวงู ขายได้ 18,545 ชิ้น Shopee มียอดขายสูงกว่า Lazada ถึงกว่า 8 เท่า
    3. **รีวิวสินค้าสูงสุด**: ทั้ง Shopee และ Lazada มีสินค้าที่ได้รับคะแนนรีวิวสูงสุดที่ 5.0 แต่เป็นสินค้าต่างกัน
    4. **ราคากับรีวิว**: สินค้าราคาสูงกว่าค่าเฉลี่ยมีแนวโน้มได้รับรีวิวต่ำกว่าเล็กน้อยเมื่อเทียบกับสินค้าราคาต่ำกว่าค่าเฉลี่ย
    5. **ส่วนลดกับยอดขาย**: การลดราคามากกว่า 30% ส่งผลให้ยอดขายเพิ่มขึ้นอย่างมากในบางสินค้า เช่น ข้าวเหนียวพันธุ์ กข6 และข้าวเหนียวสันป่าตอง
    6. **ราคาหลังหักส่วนลดกับรีวิว**: สินค้าราคาหลังหักส่วนลดต่ำกว่าค่าเฉลี่ยได้รับรีวิวที่ดีกว่าสินค้าที่มีราคาหลังหักส่วนลดสูงกว่า
    7. **พื้นที่ที่มียอดขายสูงสุด**: จังหวัดนครราชสีมาเป็นพื้นที่ที่มีการใช้จ่ายสูงสุดในสินค้าที่มีราคาหลังหักส่วนลด
    8. **ผลของการลดราคาในแพลตฟอร์ม**: แม้ Lazada จะมีการลดราคาเฉลี่ยสูงกว่า Shopee แต่ Shopee มียอดขายรวมสูงกว่ามาก
'''
st.markdown(desc_msg1)
st.markdown("ข้อมูลนี้ช่วยให้เห็นถึงความแตกต่างในการจัดการราคาสินค้าและกลยุทธ์การลดราคาที่ส่งผลต่อยอดขายในแต่ละแพลตฟอร์มอย่างชัดเจน")