import streamlit as st
from menu import menu_with_redirect
from utils.func import hide_header_icons

st.set_page_config(page_title=f"ข้อเสนอแนะเพิ่มเติม", page_icon="📈")
st.header(f":blue[ข้อเสนอแนะเพิ่มเติม]", divider=True)
# st.subheader(sub)

menu_with_redirect()
hide_header_icons()


desc_msg1 = '''
    **1. Shopee ควรเน้นการลดราคาที่เหมาะสมเพื่อรักษายอดขายสูง**\n
    แม้ Shopee จะมียอดขายเฉลี่ยสูง แต่การลดราคาที่มากกว่า 30% ดูเหมือนจะมีผลบวกกับยอดขายในบางสินค้า การพิจารณาใช้กลยุทธ์ลดราคาที่เหมาะสมกับประเภทสินค้าที่ตอบสนองดีต่อส่วนลดจะช่วยรักษาความได้เปรียบนี้

    **2. Lazada ควรปรับปรุงกลยุทธ์ส่วนลดและการตลาด**\n
    แม้ว่า Lazada จะมีอัตราการลดราคาสูงกว่า Shopee แต่ผลลัพธ์ที่ได้นั้นไม่เพิ่มยอดขายเท่าที่ควร Lazada อาจต้องพิจารณากลยุทธ์อื่น ๆ เช่น การส่งเสริมการขาย การโฆษณาเฉพาะกลุ่ม หรือการเพิ่มความน่าสนใจของสินค้า เพื่อให้สอดคล้องกับการลดราคาและดึงดูดลูกค้ามากขึ้น

    **3. การมุ่งเน้นพื้นที่ที่มีศักยภาพสูงในการขาย**\n
    จังหวัดนครราชสีมาแสดงให้เห็นถึงการใช้จ่ายที่สูง การขยายการตลาดหรือจัดโปรโมชันเฉพาะพื้นที่ที่มียอดขายสูงในปัจจุบัน อาจเป็นทางเลือกที่ดีในการเพิ่มยอดขายในพื้นที่อื่น ๆ ที่คล้ายคลึงกัน

    **4. ใช้รีวิวเป็นตัวชูโรงสำหรับสินค้าที่ได้รับคะแนนสูง**\n
    ทั้ง Shopee และ Lazada ควรส่งเสริมสินค้าที่ได้รับรีวิวดี โดยใช้รีวิวเหล่านี้ในการทำการตลาดเพิ่มเติม อาจใช้ในโฆษณาหรือหน้าแนะนำสินค้าบนแพลตฟอร์ม เพื่อสร้างความเชื่อมั่นให้กับลูกค้าและกระตุ้นการขาย

    **5. การทดลองกลยุทธ์ส่วนลดที่ยืดหยุ่นและหลากหลาย**\n
    แนะนำให้ทดลองใช้ส่วนลดในหลากหลายรูปแบบ เช่น การลดราคาเฉพาะช่วงเวลาหรือเฉพาะกลุ่มลูกค้า การลดราคาสำหรับสินค้าที่มียอดขายต่ำกว่าเกณฑ์ หรือการจัดกิจกรรม Flash Sale เพื่อเพิ่มยอดขายของสินค้าที่มีศักยภาพสูง

    **6. ส่งเสริมการลดราคาที่ผสานกับการให้คะแนนรีวิว**\n
    เนื่องจากสินค้าราคาถูกมีแนวโน้มได้รับรีวิวที่ดีกว่า อาจมีการเชื่อมโยงการลดราคากับการกระตุ้นให้ลูกค้าเขียนรีวิวเพิ่มเติม เพื่อสร้างฐานรีวิวที่ดีสำหรับสินค้าในระยะยาว
'''
st.markdown(desc_msg1)



